import * as React from "react";
import Scroll from "../scroll";
const onPull = () => {
    console.log('更新完成')
}
const scrollExample: React.FunctionComponent = () => {
  return (
    <Scroll style={{height: 300}} onPull={onPull}>
      <h1>大美女</h1>
      <p>胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大</p>
      <p>胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大</p>
      <p>胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大</p>
      <p>胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大</p>
      <p>胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大</p>
      <p>胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大</p>
      <p>胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大</p>
      <p>胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大</p>
      <p>胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大</p>
      <p>胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大</p>
      <p>胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大</p>
      <p>胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大</p>
      <p>胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大</p>
      <p>胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大</p>
      <p>胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大胸大</p>
    </Scroll>
  )
}
export default scrollExample;